www/about/resume.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Резюме</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Резюме</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org362291d">ООО Автоматон</a>
<ul>
<li><a href="#org4c20a65">Системный архитектор</a></li>
</ul>
</li>
<li><a href="#orgeb10979">ООО БКН</a>
<ul>
<li><a href="#org5af8eb4">ИТ-директор</a></li>
</ul>
</li>
<li><a href="#org7a3e946">Тренд</a>
<ul>
<li><a href="#org6199ed1">Ведущий инженер-программист</a></li>
</ul>
</li>
<li><a href="#orgb95df0b">Частная компания (алготрейдинг)</a>
<ul>
<li><a href="#org65aa8e2">Lisp/Erlang-разработчик</a></li>
</ul>
</li>
<li><a href="#org4c867c5">ООО РАВТА</a>
<ul>
<li><a href="#org702ea6f">Технический директор</a></li>
</ul>
</li>
<li><a href="#orgd82de33">WizardSoft</a>
<ul>
<li><a href="#orgdde9693">Ведущий разработчик, архитектор</a></li>
</ul>
</li>
<li><a href="#orgcf6132d">ЦиFры</a>
<ul>
<li><a href="#orgf8af8b5">Архитектор-проектировщик, веб-программист</a></li>
</ul>
</li>
<li><a href="#org16fa972">ООО Вебдом</a>
<ul>
<li><a href="#org3616dae">Ведущий веб-разработчик</a></li>
</ul>
</li>
<li><a href="#orgd5bf01e">Почин</a>
<ul>
<li><a href="#orgabf6a44">Программист</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org362291d" class="outline-2">
<h2 id="org362291d">ООО Автоматон</h2>
<div class="outline-text-2" id="text-org362291d">
</div>
<div id="outline-container-org4c20a65" class="outline-3">
<h3 id="org4c20a65">Системный архитектор</h3>
<div class="outline-text-3" id="text-org4c20a65">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">c</td>
<td class="org-left">по</td>
</tr>

<tr>
<td class="org-right">2015-12-01</td>
<td class="org-left">настоящее время</td>
</tr>
</tbody>
</table>

<p>
Компания занимается разработкой и эксплуатацией автоматизированных
парковок.
</p>

<p>
Я возглавил исследовательский проект по разработке новой парковочной
системы: аппаратной и программной части.
</p>

<p>
Технологии:
</p>
<ul class="org-ul">
<li>Проектирование печатных плат - Kikad, Altium Designer</li>
<li>Программирование: С/С++, Assembler, Erlang (телефония), PHP/JS:
Symfony+React (веб-интерфейс), EmacsLisp - кодогенерация для
"исполняемых спецификаций" и утилиты для совместной удаленной работы
в команде</li>
<li>Архитектурный стек - Linux on ARM Cortex A8 и Symphony+React в
интерфейсе управления платной парковкой.</li>
</ul>

<p>
Разработку проводил с нуля, по этапам:
</p>
<ul class="org-ul">
<li>Найм сотрудников</li>
<li>Выбор электронных компонентов,</li>
<li>Создание печатных плат,</li>
<li>Написание низкоуровневого кода, управляющего шлагбаумами и
опрашивающего датчики</li>
<li>Написание бизнес-логики и веб-интерфейсов, через которые можно
управлять парковкой удаленно,</li>
<li>Подключение интернет-телефонии, для общения с клиентом в
нестандартных ситуациях</li>
</ul>

<p>
Первое внедрение состоялось через полгода от начала разработки,
разработка полностью окупилась через год. Технологически разработанное
решение опережает конкурирующие. В том числе, по соотношению
цена/качество (но не в отношении пром-дизайна) - опережает даже
большинство зарубежных конкурентов.
</p>

<p>
Мои достижения:
</p>

<ul class="org-ul">
<li>Спроектировал программно-аппаратную архитектуру системы
автоматизации платных парковок.</li>
<li>Спланировал и организовал работы по разработке ПО и аппаратной
части, включая подбор электронных компонентов и схемотехническое
проектирование.</li>
<li>Самостоятельно реализовал бизнес-логику и уровень представления
(Рабочее Место Оператора) на Symfony и React</li>
<li>Руководил работами по реализации транспортного уровня и уровня
абстракции оборудования, выполненными удаленными разработчиками
(C/C++, модули ядра, драйверы устройств)</li>
<li>Организовал паралельную разработку по модульному принципу (чтобы
ускорить создание продукта) и методологии kanban</li>
<li>Внедрил Continuous Integration и процесс управления жизненным циклом
(релизы, исправление ошибок, добавление возможностей, технический
контроль качества, автоматизированное тестирование)</li>
<li>Реализовал безопасное (цифровая подпись) и отказоустойчивое (откат
на предыдующую версию при провале тестов) обновление прошивок через
интернет.</li>
<li>Автоматизировал создание и хранение документации, с использованием
версионирования на базе GIT и "executable specifications".</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgeb10979" class="outline-2">
<h2 id="orgeb10979">ООО БКН</h2>
<div class="outline-text-2" id="text-orgeb10979">
</div>
<div id="outline-container-org5af8eb4" class="outline-3">
<h3 id="org5af8eb4">ИТ-директор</h3>
<div class="outline-text-3" id="text-org5af8eb4">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">c</td>
<td class="org-right">по</td>
</tr>

<tr>
<td class="org-right">2015-04-01</td>
<td class="org-right">2015-12-01</td>
</tr>
</tbody>
</table>

<p>
Компания - второй после "Бюллетеня недвижимости" информационный
источник в области недвижимости по С-Пб и ЛО.
</p>

<p>
Руководил разработкой и продвижением информационных решений
автоматизации бизнеса агентств недвижимости (b2b и b2c).
</p>

<p>
Стек технологий: C# и ASP.NET, ExtJs
</p>

<p>
Достижения:
</p>

<ul class="org-ul">
<li>Используя данные "межагентской БД bkn-profi" в короткие сроки создал
раздел о жилых комплексах и новостройках, который по обьему вскоре
достиг 60% сайта, что позволило резко увеличить доходы от рекламы на
сайте.</li>
<li>Реализовал на сайте bkn.ru раздел поиска и подбора квартир, комнат и
жилых домов первичного и вторичного рынка, интегрировал его с
межагентской БД объектов недвижимости.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7a3e946" class="outline-2">
<h2 id="org7a3e946">Тренд</h2>
<div class="outline-text-2" id="text-org7a3e946">
</div>
<div id="outline-container-org6199ed1" class="outline-3">
<h3 id="org6199ed1">Ведущий инженер-программист</h3>
<div class="outline-text-3" id="text-org6199ed1">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">c</td>
<td class="org-right">по</td>
</tr>

<tr>
<td class="org-right">2014-08-01</td>
<td class="org-right">2015-03-01</td>
</tr>
</tbody>
</table>

<p>
Компания - молодое быстрорастущее агентство недвижимости,
специализирующееся на первичном рынке (новостройки)
</p>

<p>
Автоматизировал бизнес-процесс агенства по продажам недвижимости
(новостройки).
</p>

<p>
Стек технологий: Php, Nginx, Mysql, PostgreSql
</p>

<p>
Достижения:
</p>

<p>
До моего прихода агенты и риэлторы использовали skype и google docs
для выполнения задач, но после увеличения численности в 4 раза эти
инструменты стали неэффективны. Я внедрил CRM собственной разработки,
модули которой (экспертная система выставления цен, интерактивный
подбор объектов) освободили работников от рутины.
</p>

<p>
Также реорганизовал сайт компании с использованием современных
технологий.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb95df0b" class="outline-2">
<h2 id="orgb95df0b">Частная компания (алготрейдинг)</h2>
<div class="outline-text-2" id="text-orgb95df0b">
</div>
<div id="outline-container-org65aa8e2" class="outline-3">
<h3 id="org65aa8e2">Lisp/Erlang-разработчик</h3>
<div class="outline-text-3" id="text-org65aa8e2">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">с</td>
<td class="org-right">по</td>
</tr>

<tr>
<td class="org-right">2012-04-01</td>
<td class="org-right">2014-08-01</td>
</tr>
</tbody>
</table>

<p>
Стек технологий: Erlang, Common Lisp, C++
</p>

<p>
К сожалению, по условиям NDA я не имею права распространять в сети
информацию о деятельности компании и моих разработках :(
</p>
</div>
</div>
</div>

<div id="outline-container-org4c867c5" class="outline-2">
<h2 id="org4c867c5">ООО РАВТА</h2>
<div class="outline-text-2" id="text-org4c867c5">
</div>
<div id="outline-container-org702ea6f" class="outline-3">
<h3 id="org702ea6f">Технический директор</h3>
<div class="outline-text-3" id="text-org702ea6f">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">с</td>
<td class="org-right">по</td>
</tr>

<tr>
<td class="org-right">2012-01-01</td>
<td class="org-right">2012-04-01</td>
</tr>
</tbody>
</table>

<p>
Осуществлял руководство разработкой информационной системы
предприятия, занимался |становкой задач и контролем вы|лнения
работ. Организовывал договорную работу с |дрядчиками.
</p>

<p>
Компания - интернет-магазин запчастей, комплектующих и расходных
материалов для автомобилей.
</p>

<p>
Осуществлял руководство разработкой информационной системы
предприятия, занимался постановкой задач и контролем выполнения
работ. Организовывал договорную работу с подрядчиками.
</p>

<p>
Достижения:
</p>

<p>
Внедрил на фирме 1-С Предприятие и 1С-Склад и обеспечил ее интеграцию
с системой TechDoc.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd82de33" class="outline-2">
<h2 id="orgd82de33">WizardSoft</h2>
<div class="outline-text-2" id="text-orgd82de33">
</div>
<div id="outline-container-orgdde9693" class="outline-3">
<h3 id="orgdde9693">Ведущий разработчик, архитектор</h3>
<div class="outline-text-3" id="text-orgdde9693">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">с</td>
<td class="org-right">по</td>
</tr>

<tr>
<td class="org-right">2011-05-01</td>
<td class="org-right">2012-01-01</td>
</tr>
</tbody>
</table>

<p>
Компания занимается автоматизацией управления затратами в
стоительстве.
Достижения:
</p>

<p>
Разработал высоконагрузочный портал для проведения строительных
тендеров. Прототип реализовал на Common Lisp, Postmodern и
PostgreSQL. После приемки прототип был существенно расширен и
переписан на PHP
</p>
</div>
</div>
</div>

<div id="outline-container-orgcf6132d" class="outline-2">
<h2 id="orgcf6132d">ЦиFры</h2>
<div class="outline-text-2" id="text-orgcf6132d">
</div>
<div id="outline-container-orgf8af8b5" class="outline-3">
<h3 id="orgf8af8b5">Архитектор-проектировщик, веб-программист</h3>
<div class="outline-text-3" id="text-orgf8af8b5">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">с</td>
<td class="org-right">по</td>
</tr>

<tr>
<td class="org-right">2009-09-01</td>
<td class="org-right">2011-04-01</td>
</tr>
</tbody>
</table>

<p>
Компания - интернет-магазин цифровой техники.
</p>

<p>
Стек технологий: PHP, MySql, Jquery, Common Lisp, Memcached
</p>

<p>
Достижения:
</p>

<ul class="org-ul">
<li>На первом этапе в кратчайшие сроки подготовил legacy-код к
новогодним нагрузкам путем внедрения кэширования.</li>
<li>Затема полностью перепроектировал и реализовал на высоконагрузочный
интернет-магазин.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org16fa972" class="outline-2">
<h2 id="org16fa972">ООО Вебдом</h2>
<div class="outline-text-2" id="text-org16fa972">
</div>
<div id="outline-container-org3616dae" class="outline-3">
<h3 id="org3616dae">Ведущий веб-разработчик</h3>
<div class="outline-text-3" id="text-org3616dae">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">с</td>
<td class="org-right">по</td>
</tr>

<tr>
<td class="org-right">2007-01-01</td>
<td class="org-right">2009-09-01</td>
</tr>
</tbody>
</table>

<p>
Веб-студия
Стек технологий: Php, Nginx, MySql
</p>

<p>
Достижения:
</p>

<p>
Cпроектировал и разработал масштабируемый фреймворк, на котором теперь
работает компания. CMS на его основе поставляются клиентам.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd5bf01e" class="outline-2">
<h2 id="orgd5bf01e">Почин</h2>
<div class="outline-text-2" id="text-orgd5bf01e">
</div>
<div id="outline-container-orgabf6a44" class="outline-3">
<h3 id="orgabf6a44">Программист</h3>
<div class="outline-text-3" id="text-orgabf6a44">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-right">с</td>
<td class="org-right">по</td>
</tr>

<tr>
<td class="org-right">2005-09-01</td>
<td class="org-right">2007-01-01</td>
</tr>
</tbody>
</table>

<p>
Компания - интернет-магазин авточехлов, автозапчастей и
автоинструмента.
</p>

<p>
Стек технологий: LAMP
</p>

<p>
Первоначально начинал как фриланс-программист, но скоро сотрудничество
стало постоянным.
</p>

<p>
Достижения:
</p>

<ul class="org-ul">
<li>Спроектировал и разработал интернет-магазин (три версии за полтора года)</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
